Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ཡོད་པ་དང་མེད་པའམ། དངོས་པོ་འམ། དངོས་པོ་མ་ཡིན་པར་རྣམ་པར་རྟོག་པ་གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་རོ།
en: There is no doubt that where there is the perception “it is form,” the false imagining that it is there or it is not there, or that it is an existent thing or a nonexistent thing, arises.

source: །ཡང་ན་གཟུང་བ་དང་འཛིན་པའི་དངོས་པོར་འགྱུར་བའི་ཕྱིར་གཉིས་ཞེས་བྱའོ།
en: Alternatively, it says “duality” because of a grasped and grasper in the form of existent things. “

source: །ཇི་ཙམ་དུ་དངོས་པོ་ཡོད་པ་དེ་ཙམ་དུ་འདུ་བྱེད་དོ་ཞེས་བྱ་བ་ནི།
en: To the extent there is an existent thing, to that extent there are volitional factors.”

source: དངོས་པོར་རྣམ་པར་རྟོག་པས། བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་ལ་སོགས་པའི་འདུ་བྱེད་རྣམས་སྐྱེས་པར་འགྱུར་རོ།
en: The conceptualization of an existent thing gives rise to volitional factors that are good, bad, and so on.

source: །དངོས་པོ་ཡོངས་སུ་འདོར་རོ་ཞེས་བྱ་བ་ནི། རྣམ་པར་སྨིན་པ་ཡོངས་སུ་མི་འདོར་བའོ།
en: To “thoroughly reject an existent thing” is not to thoroughly reject the maturation. “[

source: །ཆོས་ཐམས་ཅད་ལ་མངའ་བསྒྱུར་བ་ཞེས་བྱ་བ་ནི་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་པོ། །ཡུལ་ལ་མངའ་བརྙེས་པར་གྱུར་ཅེས་བྱ་བ་ནི་མངོན་པར་ཤེས་པ་དང་དབང་བཅུའོ།
en: They] gain control over all dharmas,” over perfect, complete awakening; “[they] gain control over the range of all phenomena,” the clairvoyances and the ten controls. “

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་འདི་ལ་ང་སྔོན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཞེས་བྱ་བ་ལ་སོགས་པས་དེ་སྟོན་ཏེ། ང་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་སྤྱོད་ཅིང་མངོན་པར་ཤེས་པ་ལ་སོགས་པ་ལ་ཡང་སྙོམས་པར་འཇུག་པ་དེ་ན། མཚན་མ་ལ་རོ་མྱང་བ་མེད་པར་དམིགས་པ་ཅན་གྱི་འདུ་ཤེས་བསལ་ཏེ། རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་འདུ་ཤེས་བསྐྱེད་ཅིང་སྤྱད་ནས།
en: Here, earlier when I was practicing the bodhisattva’s practice of the six perfections,” and so on, is teaching the following: “When I was the one practicing the six perfections and entering into absorption in the clairvoyances and so on, having eliminated perceptions with any objective support, I produced and practiced a naturally purified perception without relishing the experience of the causal signs.

source: ནམ་མཁའ་ཡིད་ལ་བྱེད་པ་ཉིད་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཕྱིས་རྗེས་ལ་ཐོབ་པའི་ཡེ་ཤེས་ཀྱིས་ཀྱང་། འཕགས་པའི་བདེན་པ་བཞི་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Having fully awakened by just paying attention to space, and, following that, having fully awakened to the four noble truths with subsequent attainment knowledge, I actualized the qualities of a buddha.

source: ཀུན་རྫོབ་ཡིད་ལ་བྱེད་པས། སེམས་ཅན་རྣམས་ཕུང་པོ་གསུམ་དུ་ལུང་བསྟན་པར་གྱུར་ཏེ།
en: By paying attention to the conventional I prophesied beings in the three groups.”

source: དེ་བས་ན་མི་དམིགས་པ་ཉིད་ཀྱིས་སྤྱོད་པ་དང་། མི་དམིགས་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་པར་འགྱུར་བས། ཉེས་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means he was therefore faultless because he practiced in a state where nothing is apprehended and became awakened in a state where nothing is apprehended.

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་གལ་ཏེ་བསམ་གཏན་དང་། མངོན་པར་ཤེས་པ་དང་། སེམས་ཅན་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་ན་དེ་དག་ཇི་ལྟར་བསྐྱེད། སེམས་ཅན་རྣམས་ཀྱང་ཇི་ལྟར་ལུང་བསྟན་ཞེས་གནས་བརྟན་གྱིས་ཞུས་པའོ།
en: With, “Lord, how has a tathāgata, worthy one, perfectly complete buddha,” and so on, the elder is asking: if concentrations, clairvoyances, and beings are the nonexistence of an intrinsic nature, how have you produced them, and prophesied those beings?

source: །དེས་ན་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་གལ་ཏེ་འདོད་པ་རྣམས་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱ་བ་ལ་སོགས་པས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་ཐམས་ཅད་གྲུབ་ཀྱི། གཞན་དུ་ནི་མ་ཡིན་ནོ་ཞེས་བསྟན་ཏེ། འདི་ལྟར་འདོད་པ་རྣམས་དང་།
en: Then the Lord, with “Subhūti, were an intrinsic nature of sense objects or of wrong unwholesome dharmas,” and so on, teaches that because they are the nonexistence of an intrinsic nature everything is established, not otherwise.

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་ཏེ་དེའི་ཕྱིར་ལུང་བསྟན་ཏོ། །བསམ་གཏན་རྣམས་བསྐྱེད་དོ། །དངོས་པོའམ། དངོས་པོ་མེད་པའམ། རང་གི་དངོས་པོའམ།
en: So, it is because sense objects and wrong unwholesome dharmas are the nonexistence of an intrinsic nature that they have been prophesied and the concentrations produced.

source: གཞན་གྱི་དངོས་པོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་དངོས་པོའི་བདག་ཉིད་ཀྱིས་མ་ཡིན་གྱི། རི་བོང་གི་རྭ་བཞིན་དུ་ཤིན་ཏུ་དངོས་པོ་མེད་པའི་བདག་ཉིད་ཀྱིས་ནི་མ་ཡིན་ལ། རང་གི་དངོས་པོའི་བདག་ཉིད་འགའ་ཞིག་ཏུ་ཡང་མ་ཡིན་གྱི། གཞན་གྱི་དངོས་པོའི་བདག་ཉིད་འགའ་ཞིག་ཏུ་མ་ཡིན་ནོ་ཞེས་བསྟན་པའོ།
en: They “are not existent things, or nonexistent things, or intrinsically existent things, or dependently existent things” is teaching that they are not constituted as falsely imagined existent things, are not totally nonexistent things like a rabbit’s horns, also are not something constituted as its own existent thing, and are also not something constituted as a dependent existent thing. “

source: །ཇི་ལྟར་མཐར་གྱིས་སྤྱོད་པ་དང་། མཐར་གྱིས་སློབ་པ་དང་།
en: How… will there be serial action, serial training, and serial practice?”

source: མཐར་གྱིས་ནན་ཏན་དུ་བགྱི་བ་མཆིས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་སྒྱུ་མའི་གླང་པོ་ཆེ་ལ་སོགས་པར་དམིགས་པ་དང་། མི་དམིགས་པ་དག་འཕྲལ་ཁོ་ན་ལ་འགྱུར་བ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་འཕྲལ་ཁོ་ན་ལ་དམིགས་སུ་མེད་པ་རྟོགས་པར་འགྱུར་གྱི་རིམ་གྱིས་ནི་མ་ཡིན་ནོ་ཞེས་དགོངས་པའོ།
en: The intention is that just as apprehending and not apprehending a magically produced illusory elephant and so on happens suddenly, so too the bodhisattvas’ realization that does not apprehend anything happens suddenly; it does not happen gradually.

source: །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་ཐོག་མར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་བསྟན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་གི་དོན་དུ་མཐར་གྱི་སྤྱོད་པ་མི་རྩོམ་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཕྲལ་ལ་ཤེས་པར་མི་ནུས་ཏེ། རིམ་གྱིས་ཤེས་པར་བྱ་བའི་ཕྱིར་རིམ་གྱིས་རྩོམ་སྟེ།
en: With “Subhūti, here bodhisattva great beings from the very outset have heard from the lord buddhas… that an intrinsic nature… is nonexistent,” and so on, the Lord explains that bodhisattvas are not vigorously attempting the series of practices for their own benefit; rather, they are gradually making the vigorous attempt so that all beings will come to a gradual understanding, because they are incapable of a sudden understanding. “

source: སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་ཞེས་བྱ་བ་ལ་སོགས་པས། དེ་དག་གི་རིམ་པ་སྟོན་ཏོ།
en: Starting from the first production of the thought,” and so on, teaches the order of the unfolding series. “

source: །ཞུགས་ནས་ཞེས་བྱ་བ་ནི་སེམས་སྐྱེད་ནས་སོ།
en: Having [transcended the śrāvaka level and pratyekabuddha level], they enter,” after they have produced the thought. “

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ངོ་བོ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཡོད་པའམ་མེད་པ་དམིགས་སུ་ཡོད་སྙམ་མམ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་མེད་པར་འཛིན་པར་གྱུར་ན་ཆད་པར་འགྱུར་རོ།
en: Do you think you can apprehend a ‘there-is’ or a ‘there-is-not’ in all the phenomena that are the nonexistence of an intrinsic nature” and that are the intrinsic nature of six perfections? If taken as nonexistence, it becomes an annihilation.

source: །དངོས་པོ་མེད་པ་དང་ངོ་བོ་ཉིད་དུ་སྨྲ་བ་རྣམས་དངོས་པོ་མེད་པར་སྨྲ་བ་དང་ངོ་བོ་ཉིད་ཡོད་པར་སྨྲ་བས། ཡོད་པའམ་མེད་པ་ཉིད་ཀྱི་མཐར་བྱར་མི་རུང་བས་བསྟན་པའོ།
en: Those who say they are not existent things, and they are intrinsic natures, say there are not existent things and say there are intrinsic natures, so it is teaching that it is not suitable to take them at the extremes of “there-is” and “there-is-not.” “

source: །རབ་འབྱོར་མི་དམིགས་པ་ཉིད་ཐོབ་པའོ། །མི་དམིགས་པ་ཉིད་མངོན་པར་རྟོགས་པའོ་ཞེས་བྱ་བ་ནི་མི་དམིགས་པ་ཐོབ་པ་དང་།
en: Just the absence of an apprehended object is attainment, just the attainment of the absence of an apprehended object is clear realization.”

source: མི་དམིགས་པའི་མངོན་པར་རྟོགས་པ་ཞེས་བརྗོད་ན་ཐོབ་པར་བྱ་བ་དང་།
en: If it had said “attainment is without an apprehended object, and clear realization does not apprehend an object,” there would be something to be attained and a clear realization to be had, so there would be the absence of an apprehended object and hence the colossal blunder of apprehending something.

source: མངོན་པར་རྟོགས་པར་བྱ་བའི་ཕྱིར་མི་དམིགས་པ་ཡོད་པར་འགྱུར་ཏེ། དེ་ལྟ་ན་ནི་དམིགས་པ་ཉིད་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཅེས་བརྗོད་པར་བསྟན་ཏོ།
en: Therefore it teaches that just the absence of an apprehended object is spoken of as “attainment… clear realization,” and “unsurpassed, perfect, complete awakening.” “

source: །རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་ཡང་ག་ལ་མཆིས་ཞེས་བྱ་བ་ནི་ས་བརྒྱད་པ་ཡན་ཆད་ལ་རྣམ་པར་སྨིན་པའི་མངོན་པར་ཤེས་པ་དང་། རྣམ་པར་སྨིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཉེ་བར་གནས་སོ།
en: How will there be the clairvoyances arisen from maturation?” The clairvoyances arisen from maturation and the perfections arisen from maturation are located from the eighth level on up.

source: །མཐར་གྱིས་གྲུབ་པ་བསྟན་པ་ཐམས་ཅད་ནི་གོ་སླའོ།
en: All of the explanation of serial practice is easy to understand.

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་སེམས་གཅིག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པ་ཞུས་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་སྦྱིན་པ་བྱིན་ན་ཞེས་བྱ་བ་བརྗོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱང་གཅིག་ཏུ་འགྱུར་རོ་ཞེས་བསྟན་པའོ།
en: In regard to the question, “Lord, when bodhisattva great beings are practicing the perfection of wisdom, how do they complete the six perfections in a single thought?” and so on, it says “when they give gifts it is informed by the perfection of wisdom,” explaining that because they are informed by the perfection of wisdom all beings also become one. “

source: །གཞན་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་གཅིག་ཁོ་ནར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Nothing other than” means simply just the one.

source: །དེ་ནས་ཞུས་པ་གཉིས་པ་ལ་ཡང་། སེམས་གཉིས་སུ་མེད་པའི་ཕྱིར་སེམས་གཅིག་གོ་ཞེས་སྟོན་ཏོ།
en: Then again, in response to the second question, it explains that it is a single thought because it is not a dualistic thought.

source: །གཉིས་ཀྱི་འདུ་ཤེས་མེད་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སོགས་པ་ཆོས་ཐམས་ཅད་སྒོམ་པ་ནི་གོ་སླའོ།
en: The cultivation of all dharmas, the six perfections and so on, while “not having a dualistic notion” is easy to understand. “

source: །མཚན་མ་དང་བྲལ་བའི་སེམས་ཟག་པ་མེད་པས་སྦྱིན་པ་བྱིན་ན་རྣམ་པར་སྨིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་ས་བརྒྱད་པ་ཡན་ཆད་ཉོན་མོངས་པ་འབྱུང་བ་མེད་པ་དང་། རྣམ་པར་སྨིན་པ་ཡིན་པའི་ཕྱིར་དེ་སྐད་ཅེས་བསྟན་ཏོ།
en: When they give gifts with a thought free from causal signs, without outflows, the perfection of maturation is completed.” It teaches that, because from the eighth level on up afflictions do not arise and it is a maturation. “

source: །སྦྱིན་པ་དེས་ཅི་ཞིག་བྱ་བ་ཞེས་བྱ་བ་ནི་བདུད་ཀྱི་རིས་རྣམས་སྨྲ་བའོ།
en: This gift you have given is worthless” is said by the Māra class of gods.

source: །དེའི་འོག་ཏུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་རྣམ་པར་སྨིན་པའི་མངོན་པར་ཤེས་པ་དང་བཅས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པ་ནི་གཞུང་ཉིད་ལས་གཟུང་བར་བྱའོ།
en: Then the completion of the six perfections and the maturation of the clairvoyances can be grasped from the text itself.

source: །ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཤེས་པ་བསྟན་པས་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་ཡང་གོ་སླ་བ་ཉིད་དོ།
en: It is also very easy to understand the exposition of the perfections arisen from maturation from the teaching about the knowledge of the mark of all dharmas.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ཀྱི་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་རྣམས་ལ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཞུས་པ་དང་། ལན་དང་ངོ་མཚར་རྨད་དུ་བྱུང་བ་བསྟན་པ་དང་། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་སྦྱིན་པ་དག་ཀྱང་གཞུང་ཉིད་ལས་གཟུང་བར་བྱའོ།
en: Explanation of Chapter 73 Then the question, “Lord, how, when all dharmas are like a dream, have nonexistence for their intrinsic nature, and are empty of their own marks,” and so on—the response is that the teaching is amazing and marvelous, and the two gifts of Dharma, the ordinary and extraordinary, should be grasped right from the scripture itself.

source: །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་སྦྱིན་པ་བསྟན་པའི་ལྷག་མ་ནི་སྔར་བསྟན་ཟིན་ཏེ།
en: Among the extraordinary gifts of Dharma, most have already been explained.

source: སྔར་མ་བསྟན་པ་དག་བསྟན་ཏོ།
en: I will explain the ones I have not explained before.

source: །དེ་ལ་ཉོན་མོངས་པ་མེད་པ་གང་ཞེ་ན་ཞེས་བྱ་བ་ནི་བདག་གི་ཕྱིར་གཞན་དག་ལ་ཉོན་མོངས་པ་སྐྱེ་བར་མ་གྱུར་ཅིག་ཅེས་བྱིན་གྱིས་བརླབས་ནས་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་གཞན་གྱི་རྒྱུད་ལ་ཉོན་མོངས་པ་སྐྱེ་བའི་སྐབས་མི་འབྱེད་པ་དེ་ནི་ཉོན་མོངས་པ་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཞེས་བྱའོ།
en: Among them is, “What is conflict-free meditative stabilization?” Having become absorbed in a meditative stabilization sustained by the power of the thought “may afflictions not arise in others on account of me,” through the force of the earlier prayer that is a vow that does not provide an opportunity for afflictions to arise in the mindstreams of others, is called “conflict-free absorption.” “

source: །དེ་ལ་སྨོན་ལམ་གྱི་ཤེས་པ་གང་ཞེ་ན་ཞེས་བྱ་བ་ནི་དུས་གསུམ་དང་ཁམས་གསུམ་གྱི་ཆོས་རྣམས་ལས་ཤེས་པར་བྱ་བར་བསྡུས་པའི་ཆོས། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པར་གཏོགས་པ་གང་ཡང་རུང་བ་འགའ་ཞིག་ཤེས་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་པས་ན་དེ་དེ་མ་ཐག་ཏུ་ཤེས་པ་གང་གི་ཤེས་པར་གྱུར་པ་དེ་སྨོན་ལམ་སྔོན་དུ་འགྲོ་བའི་ཤེས་པ་ཡིན་པས་སྨོན་ནས་ཤེས་པ་ཞེས་བྱའོ།
en: There, what is knowledge from prayer?” Immediately after a prayer has been made to know some phenomenon included in knowable things—anything at all from the phenomena of the three time periods and three realms included in the ordinary and extraordinary—that knowledge through which it comes to be known is called “knowledge from prayer.” “

source: །དེ་ལ་ཡོངས་སུ་དག་པ་བཞི་གང་ཞེ་ན་ཞེས་བྱ་བ་ལ།
en: There, what are the four total purities?”

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གནས་ངན་ལེན་ཐམས་ཅད་གནས་དང་ཤིན་ཏུ་བྲལ་བར་གྱུར་པ་དང་། བདག་གི་ལུས་ཀྱང་ཇི་ལྟར་འདོད་པ་བཞིན་ལེན་པ་དང་། གནས་པ་དང་འཆི་འཕོ་བ་རྣམས་ལ་རང་དབང་དུ་གྱུར་པ་ནི་གནས་ཡོངས་སུ་དག་པའོ།
en: The absolute separation from the “basis”—all the final bases of suffering with which all beings are afflicted—and the independence to appropriate, remain in, and die in whatever body one wants is the “thoroughly purified basis.”

source: །སྤྲུལ་པ་དང་། ཡོངས་སུ་བསྒྱུར་བའི་གྲངས་སུ་གཏོགས་པ་དང་། དམིགས་པ་ཐམས་ཅད་ལ་དབང་དུ་གྱུར་པ་ནི་དམིགས་པ་ཡོངས་སུ་དག་པའོ།
en: Control gained over what are counted as magical productions and transformations, and over objective supports, is the “thoroughly purified objective support.”

source: །སེམས་ཀྱི་གནས་ངན་ལེན་ཐམས་ཅད་དང་བྲལ་བས་སེམས་ལ་རྣམ་པ་ཐམས་ཅད་དུ་དགེ་བ་འཕེལ་བ་ནི་སེམས་ཡོངས་སུ་དག་པའོ།
en: The increase of the wholesome in the mind to the fullest extent because of separation from the final basis of mental suffering is the “thoroughly purified mind.”

source: །མ་རིག་པའི་ཕྱོགས་ཀྱི་གནས་ངན་ལེན་ཐམས་ཅད་དང་བྲལ་བས་ཤེས་པར་བྱ་བ་ཐམས་ཅད་ལ་ཤེས་པ་སྒྲིབ་པ་མེད་པ་དབང་དུ་གྱུར་པ་ནི་ཡེ་ཤེས་ཡོངས་སུ་དག་པའོ།
en: Control over the absence of obstructions to the knowledge of all knowable things because of separation from the final basis of suffering that is on the side of ignorance is “thoroughly purified knowledge.”

source: །དེ་ལ་དབང་བཅུ་གང་ཞེ་ན་ཞེས་བྱ་བ་ལ་ཇི་སྲིད་འདོད་པ་དེ་སྲིད་དུ་འདུག་པ་ནི་ཚེ་ལ་དབང་བའོ། །བསམ་གཏན་དང་ཚད་མེད་པ་དང་། རྣམ་པར་ཐར་པ་ལ་སོགས་པ་སེམས་གནས་པ་གང་གིས་གནས་པར་འདོད་པ་དེས་ཇི་ལྟར་འདོད་པ་བཞིན་གནས་པ་འདི་ནི་སེམས་ལ་དབང་བའོ། །ཀུན་དུ་བརྟགས་པ་ཙམ་གྱིས་དེ་མ་ཐག་ཏུ། དེའི་བཟའ་བ་ལ་སོགས་པ་ཡོ་བྱད་ཐམས་ཅད་ཇི་ལྟར་འདོད་པ་བཞིན་འབྱོར་པ་འདི་ནི་ཡོ་བྱད་ལ་དབང་བའོ། །སྐྱེ་བར་འགྱུར་བའི་ལས་ཐམས་ཅད་ལ་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་བསྒྱུར་བ་འདི་ནི་ལས་ལ་དབང་བའོ། །སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ།
en: There what are the ten controls? “

source: གང་དུ་འདོད་པར་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་སྐྱེ་བ་འདི་ནི་སྐྱེ་བ་ལ་དབང་བའོ། །དངོས་པོ་གང་དང་གང་ཇི་ལྟར་མོས་པར་བྱས་པ་དེ་དག་དེ་བཞིན་དུ་འགྲུབ་པ་འདི་ནི་མོས་པ་ལ་དབང་བའོ། །དེའི་སྨོན་ལམ་ཐམས་ཅད་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འགྲུབ་པ་འདི་ནི་སྨོན་ལམ་ལ་དབང་བའོ། །རྫུ་འཕྲུལ་གྱི་དགོས་པ་ཐམས་ཅད་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འགྲུབ་པ་འདི་ནི་རྫུ་འཕྲུལ་ལ་དབང་བའོ། །གང་ཡང་ཤེས་པར་བྱ་བའི་དངོས་པོར་རབ་ཏུ་ཟབ་པ་ཤེས་པར་འདོད་པ་དེ་དག་མྱུར་བ་ཉིད་དུ་ཤེས་པ་འདི་ནི་ཡེ་ཤེས་ལ་དབང་བའོ། །མིང་གི་ཚོགས་དང་།
en: Control over lifespan” is remaining for as long as they want; “control over mind” is the abiding at will in the mental abiding in which they want to abide, in a concentration, an immeasurable, a deliverance, and so on; “control over necessities” is being endowed at will with all necessities, food and so on, immediately after just having the idea of them; “control over action” is the transformation at will of all actions that evolve into birth; “control over birth” is the birth at will in all birthplaces, in whichever birth they desire; “control over belief” is the accomplishing of real things, whatever they are just as they have believed them to be; “control over prayer” is this—all their prayers being answered at will; “control over magical powers” is the accomplishing of all necessary magical powers at will; “control over knowledge” is the speedy knowledge of what they want to know—those very deep things to be known; and “control over the doctrine” is the skill at gaining, at will, collections of speech sounds, collections of words, and collections of phrases, and making a perfect presentation of all the doctrine. “

source: ཚིག་གི་ཚོགས་དང་།
en: What are the three things the tathāgatas do not have to guard against?”

source: ཡི་གེའི་ཚོགས་རྣམས་ཇི་ལྟར་འདོད་པ་བཞིན་ཐོབ་པ་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པར་རྣམ་པར་དགོད་པ་ལ་མཁས་པ་འདི་ནི་ཆོས་ལ་དབང་བའོ། །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་བསྲུང་བ་མེད་པ་གསུམ་གང་ཞེ་ན་ཞེས་བྱ་བ་ལ་སྲུང་བ་མེད་པ་གསུམ་ནི་གཞུང་ཉིད་ལས་གོ་སླའོ།
en: The three things they do not have to guard against are easy to understand from the scripture itself. “[

source: །རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པས་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ནི་གོ་སླའོ།
en: The] three applications of mindfulness” are easy to understand as the absence of attachment and anger. “

source: །བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཉིད་ཅེས་བྱ་བ་ནི་གང་དང་གང་གི་ཚེ་ཇི་ལྟར་སེམས་ཅན་གྱི་དོན་མཛད་པ་དེའི་ཚེ། དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་དུ་སྒྲུབ་པ་ནི་བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཉིད་དོ།
en: A natural state not robbed of mindfulness”— in whatever way and at whatever time the tathāgatas work for the welfare of beings, when it is accomplished, at that time it is called the “natural state not robbed of mindfulness.” Major marks and minor signs of a buddha “What are the thirty-two major marks of a great person?”

source: །སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཞེས་བྱ་བ་ནི་གཟུགས་ཚད་མར་འཛིན་པའི་གང་ཟག་རྣམས་དད་པ་བསྐྱེད་པའི་ཕྱིར་རྣམ་པར་དགོད་དོ། །དེ་ལ་རིགས་དང་བསམ་པ་དང་། མོས་པ་དང་། སྨོན་ལམ་དང་།
en: These are presented to engender faith in persons who take the body as the measure of greatness.

source: བརྩོན་འགྲུས་རྩོམ་པ་དང་། འཇུག་པ་དང་། ཡང་དག་པར་འགྲུབ་པ་དང་། ཤེས་རབ་དང་། ཐབས་ལ་སོགས་པ་ཆེ་བས་སྐྱེས་བུའི་བྱེད་པ་ཆེ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་།
en: There, bodhisattva great beings and buddhas are called “great person” because of their great humanity on account of great lineage, belief, prayer, vigorous attempt, setting out, practice that accomplishes the final result, wisdom and skillful means, and so on.

source: སངས་རྒྱས་རྣམས་ལ་སྐྱེས་བུ་ཆེན་པོ་ཞེས་བྱ་སྟེ། དེ་དག་སྐྱེས་བུ་ཆེན་པོ་ཡིན་པས་འདི་དག་གིས་བརྗོད་ཅིང་མངོན་པར་བསལ་བར་བྱེད་པའི་ཕྱིར་སྐྱེས་བུའི་ཆེན་པོའི་མཚན་རྣམས་སོ།
en: Because they are great persons, these make that clear so they are the “major marks of a great person.”

source: །འོ་ན་དེ་དག་གིས་ཡན་ལག་དང་། ཉིང་ལག་རྣམས་ལ་སྐྱེས་བུ་ཆེན་པོར་མངོན་པར་བྱེད་པ་གང་ལ་ཡང་བྱེ་བྲག་མེད་པའི་ཕྱིར། འདི་སྙེད་ཅིག་གོ་ཞེས་བྱ་བར་མི་རུང་བས་སུམ་ཅུ་རྩ་གཉིས་ཞེས་བྱ་བའི་གྲངས་དོན་མེད་པར་འགྱུར་རོ་ཞེ་ན།
en: Qualm: Well then, the number “thirty-two” is meaningless because there is no difference between the major or minor parts of their body when appearing as a great person, so it is not appropriate to think “there are this many.”

source: དེ་ཡང་བདེན་མོད་ཀྱི་འོན་ཀྱང་ཐོས་པ་དང་། དྲན་པ་དག་ལས་དེའི་རྗེས་སུ་འབྲང་བའི་དོན་དེ་ལྟ་བུའི་གྲངས་ངེས་པར་བསྟན་ཏེ། འདིར་ཡང་གྲངས་འདི་ཉིད་ཀྱིས་བསྟན་ཏོ།
en: That is true, but still, the specific number is tailored to the type of experience that follows from studying and being mindful so here too the explanation is with just that number.

source: །མཚན་འདི་རྣམས་ཀྱང་མདོར་བསྟན་པ་དང་། བཤད་པ་དང་། རྒྱུ་དང་། འབྲས་བུ་དང་། རྣམ་པ་བཞིས་བསྟན་ཏེ།
en: The explanation of these major marks, furthermore, is in four parts: overview, explanation, cause, and result.

source: དང་པོ་ནི་མདོར་བསྟན་པའོ། །དེའི་འོག་ཏུ་མཚན་དེ་རྣམས་འགྲེལ་པ་ནི་བཤད་པའོ། །སྔོན་གྱི་ལས་སྨོས་པ་ནི་རྒྱུའོ། །སྔ་ལྟས་སྨོས་པ་ནི་འབྲས་བུའོ།
en: The first is the brief teaching; then, the commentary on the major marks is the explanation, the description of earlier karma the cause, and what they presage is the result. “

source: །ཕྱག་དང་ཞབས་འཁོར་ལོའི་མཚན་དང་ལྡན་པ་ཞེས་བྱ་བ་ལ་འཁོར་ལོ་ནི་འཇིག་རྟེན་ན་རྣམ་པ་གཉིས་ཏེ།
en: They have wheel marks on the surfaces of their hands and feet.”

source: མཚོན་ཆའི་འཁོར་ལོ་དང་། འགྲོ་བ་འཇུག་པའི་འཁོར་ལོ་ཤིང་རྟ་ལ་སོགས་པའི་འཕང་ལོ་ལྟ་བུའོ།
en: Ordinarily a wheel is of two kinds: a wheel that is a weapon and the locomotion wheel, such as a wagon wheel and so on.

source: །དེ་ཡང་ཕྱག་དང་ཞབས་གཉིས་ཀ་ལ་འབྱུང་ངོ་།
en: They occur on both their hands and also their feet.

source: །འདིའི་སྔོན་གྱི་ལས་ཀྱང་རྣམ་པ་གཉིས་ཏེ། བླ་མ་ལ་སྐྱེལ་ཞིང་བསུ་བའི་གྲངས་སུ་གཏོགས་པ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་བསྡུས་པ་ནི་གཅིག་སྟེ།
en: The earlier karma for them is twofold: one, included in the perfection of morality, is listed as having “welcomed and accompanied gurus.”

source: དེའི་འབྲས་བུས་འགྲོ་བར་འཇུག་པའི་འཁོར་ལོ་ཞབས་ཀྱི་མཐིལ་དུ་འབྱུང་ངོ་།
en: This results in the appearance of locomotion wheels on the soles of their feet.

source: །ཆོས་ཉན་པ་དང་། ཕྲེང་བ་རྒྱུད་པ་དང་། གཙུག་ལག་ཁང་དང་། མཆོད་རྟེན་གྱི་གན་དུ་འགྲོ་བ་དང་།
en: The one included in the perfection of giving is having “listened to the doctrine, strung garlands, visited temples and caityas, and given the gift of servants.”

source: གཡོག་བྱིན་པ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་བསྡུས་པ་དེའི་འབྲས་བུས་ཕྱག་གི་མཐིལ་གཉིས་སུ་འབྱུང་ངོ་།
en: This results in their appearance on the palms of both hands. “

source: །འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ་མུ་ཁྱུད་ཅན་ལྟེ་བ་དང་བཅས་པ་ཞེས་བྱ་བ་གང་གི་ཚེ་འདི་གསུམ་ཡོངས་སུ་མ་རྫོགས་པ་དེའི་ཚེ་ནི་མཚན་དེ་དག་གིས་འཁོར་ལོས་སྒྱུར་བར་གྱུར་ནས་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: Wheels with a thousand spokes, with rims and hubs”— when these three are not complete it signifies that, having become wheel-turning emperors, they will go forth to homelessness.

source: །དེའི་ཚེ་ནི་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ། དཔེར་ན་རྒྱལ་པོ་ཤང་ཀ་ཞེས་བྱ་བ་ལ་སོགས་པ་ལྟ་བུའོ།
en: At that time, they will not become completely awakened, like, for example, King Śaṅka.

source: །གང་གི་ཚེ་དེ་དག་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་དེའི་ཚེ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་བས་ན་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་དེ་ན་ཞེས་གསུངས་སོ།
en: When they have become complete in every respect they will become completely awakened, therefore it says “complete in every respect.”

source: །དེ་ལ་མདོ་སྡེ་གཞན་དག་ལས་མཚན་གཞན་དང་གཞན་དཔལ་བེའུ་དང་། བཀྲ་ཤིས་དང་། སྡོང་རིས་དང་། བུམ་པ་གང་བ་དང་ཉ་སྦྲེལ་བ་དང་རྒྱལ་མཚན་དང་། དུང་དང་།
en: Qualm: Among these, the various other signs taught in other sūtras—the śrīvatsa, svastika, vardhamāna, full pot, joined fish, victory banner, conch shell, throne, white parasol, fly whisk, and so on—have not been taught, have they?

source: ཁྲི་བཟང་པོ་དང་། གདུགས་དཀར་པོ་དང་། རྔ་ཡབ་ལ་སོགས་པ་དག་ཀྱང་མ་བསྟན་ཏམ་ཞེ་ན། དེ་ཡང་བདེན་མོད་ཀྱི་གཙོ་བོར་གྱུར་པ་འཁོར་ལོའི་མཚན་དང་ལྡན་པ་བསྟན་ན་དེ་དག་ཀྱང་བསྟན་པར་འགྱུར་རོ།
en: That is true, but still, when it explains the main one—being endowed with the major wheel sign—it indicates those as well.

source: །དེ་བཞིན་གཤེགས་པའི་ཞབས་གཉིས་ལ་མི་སྣང་བའི་མཚན་བཟང་པོ་ཐམས་ཅད་མེད་པ་ཡང་མ་ཡིན་གྱི། མཚན་གྱིས་འཁོར་ལོ་དེ་དག་ཉིད་བསྡུ་བའི་ཕྱིར།
en: Some say all the major marks that do not appear on the two feet of a tathāgata are not absent because they are included as the necessary insignia of a universal emperor.
